{
  "act_dim": 1,
  "action_tanh": true,
  "activation_function": "relu",
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "max_ep_len": 48,
  "model_type": "decision_transformer",
  "n_head": 1,
  "n_inner": null,
  "n_layer": 2,
  "n_positions": 1024,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "state_dim": 27,
  "transformers_version": "4.36.2",
  "use_cache": true,
  "vocab_size": 48
}
